Tekla Open API Reference for Tekla Structures 2025
ShapeItemEnumerator Class
 The ShapeItemEnumerator class allows to loop through the shape catalog items.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.ShapeItemEnumerator
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ShapeItemEnumerator : IEnumerator
<SerializableAttribute>
Public NotInheritable Class ShapeItemEnumerator
	Implements IEnumerator
The ShapeItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a shape item instance of the current element.
Top
Methods
Name | Description
GetSize
 Returns the total amount of items.
MoveNext
 Moves to the next item in the enumerator.
Reset
 Resets the enumerator to the beginning.
Top
Examples
 The following example returns true if an item with the name Connection has been found:
using Tekla.Structures.Catalogs;
public class Example
{
       public bool Example1()
       {
           bool Result = false;
           CatalogHandler CatalogHandler = new CatalogHandler();
           if (CatalogHandler.GetConnectionStatus())
           {
               ShapeItemEnumerator ShapeItemEnumerator = CatalogHandler.GetShapes();
               while (ShapeItemEnumerator.MoveNext())
               {
                   ShapeItem ShapeItem = ShapeItemEnumerator.Current as ShapeItem;
                   if (ShapeItem.Name == "Connection")
                   {
                       Result = true;
                       break;
                   }
               }
           }
           return Result;
       }
}
See Also
Reference
Tekla.Structures.Catalogs Namespace